#Utiliza una comprensión de lista anidada para encontrar
#todos los números del 1 al 1000 que sean divisibles por cualquier dígito excepto 1 (2-9)

list= range(1,1001)
#Creamos una lista de números que son divisibles por cualquier dígito excepto 1
Divisibles = [numero for numero in list if any(numero % i == 0 for i in range(2,10))]


print(Divisibles)
#Resultado esperado: [2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 16, 18,
#20, 21, 22, 24, 25, 26, 27, 28, 30, 32, 33, 34, 35, 36, 38, 39, 40,
# 42, 44, 45, 46, 48, 49, 50, 51, 52, 54, 55, 56, 57, 58, 60, 62, 3,
# 64, 65, 66, 68, 69, 70, 72, 74, 75, 76, 77, 78, 80, 81, 82, 84, 85,
# 86, 87, 88, 90, 91, 92, 93, 94, 95, 96, 98, 99, 100, 102,
#105, 108, 110, 111, 112, 114, 115, 116, 117, 118, 119, 120, 122,
#123, 124, 125, 126, 128, 129, 130, 132, 133, 134, 135, 136, 138,
#140, 141, 142, 144, 145, 146, 147, 148, 150, 152, 153, 154, 155,
#156, 158, 159, 160, 161, 162, 164, 165, 166, 168, 170, 171, 172, 
#174, 175, 176, 177, 178, 180, 182, 183, 184, 185, 186, 188, 189,
#  190, 192, 194, 195, 196, 198, 200, 201, 202, 203, 204, 205, 206,
#  207, 208, 210, 212, 213, 214, 215, 216